valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
    // Current calibration values
    uint16_t x_min, x_max, y_min, y_max;
    XPT2046_GetCalibration(&x_min, &x_max, &y_min, &y_max);
    
    char calib_info[60];
    sprintf(calib_info, "X: %d-%d, Y: %d-%d", x_min, x_max, y_min, y_max);
    ILI9341_DrawString(20, 100, calib_info, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    
    // Coordinate mode buttons
    ILI9341_DrawControlButton(20, 130, 60, 30, ILI9341_COLOR_WHITE, "Mode 0", 1);
    ILI9341_DrawControlButton(90, 130, 60, 30, ILI9341_COLOR_WHITE, "Mode 1", 1);
    ILI9341_DrawControlButton(160, 130, 60, 30, ILI9341_COLOR_WHITE, "Mode 2", 1);
    ILI9341_DrawControlButton(230, 130, 60, 30, ILI9341_COLOR_WHITE, "Mode 3", 1);
    
    // Back button
    ILI9341_DrawControlButton(20, 200, 80, 30, ILI9341_COLOR_WHITE, "Back", 1);
}

/* Pressure Sensor Calibration page */
void ILI9341_ShowPressureCalibrationPage(void)
{
    pressure_control_page = 8; // New page for pressure sensor calibration
    
    // Clear screen
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    // Title
    ILI9341_DrawString(60, 20, "PRESSURE SENSOR", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    ILI9341_DrawString(80, 45, "CALIBRATION", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    
    // DГњZЖЏLД°Ећ: KalibrlЙ™mЙ™ dЙ™yЙ™rlЙ™rini Advanced sistemdЙ™n gГ¶tГјr
    extern CalibrationData_t g_calibration;
    
    // Update UI variables from Advanced system calibration (for consistency)
    bool calibration_valid = ILI9341_IsPressureCalibrationValid(&g_calibration);
    if (!calibration_valid) {
        // Invalid or uninitialized calibration data - use safe defaults for UI only
        adc_min = ADC_MIN;
        adc_max = ADC_MAX;
        min_pressure = PRESSURE_MIN;
        max_pressure = PRESSURE_MAX;

        if (g_calibration.calibrated) {
            printf("WARNING: UI detected suspicious calibration values (ADC: %.0f-%.0f, Pressure: %.1f-%.1f). Using defaults for display only.\r\n",
                   g_calibration.adc_min, g_calibration.adc_max,
                   g_calibration.pressure_min, g_calibration.pressure_max);
        }
    } else {
        adc_min = (uint16_t)(g_calibration.adc_min + 0.5f);
        adc_max = (uint16_t)(g_calibration.adc_max + 0.5f);
        min_pressure = g_calibration.pressure_min;
        max_pressure = g_calibration.pressure_max;
    }
    
    // Current calibration values display
    char min_volt_str[30], max_volt_str[30];
    char min_press_str[30], max_press_str[30];
    char adc_min_str[30], adc_max_str[30];
    sprintf(min_volt_str, "Min Volt: %.1fV", min_voltage);
    sprintf(max_volt_str, "Max Volt: %.1fV", max_voltage);
    sprintf(min_press_str, "Min Press: %.1f bar", min_pressure);
    sprintf(max_press_str, "Max Press: %.1f bar", max_pressure);
    sprintf(adc_min_str, "ADC Min: %d", adc_min);
    sprintf(adc_max_str, "ADC Max: %d", adc_max);
    
    ILI9341_DrawString(20, 80, min_volt_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    ILI9341_DrawString(20, 100, max_volt_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    ILI9341_DrawString(20, 120, min_press_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    ILI9341_DrawString(20, 140, max_press_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    ILI9341_DrawString(20, 150, adc_min_str, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
    ILI9341_DrawString(20, 160, adc_max_str, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
    
    /* Current ADC reading - will be updated in real-time */
    char adc_str[30];
    sprintf(adc_str, "ADC: %d", adc_min); /* Initial value */
    ILI9341_DrawString(20, 170, adc_str, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
    
    /* Instructions */
    ILI9341_DrawString(20, 180, "Touch CAL MIN/MAX to calibrate", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 1);
    
    /* Calibration buttons - larger for easier touch */
    ILI9341_DrawControlButton(20, 200, 90, 40, ILI9341_COLOR_WHITE, "CAL MIN", 1);
    ILI9341_DrawControlButton(120, 200, 90, 40, ILI9341_COLOR_WHITE, "CAL MAX", 1);
    ILI9341_DrawControlButton(220, 200, 90, 40, ILI9341_COLOR_WHITE, "SAVE", 1);
    
    /* Back button */
    ILI9341_DrawControlButton(20, 250, 90, 40, ILI9341_COLOR_WHITE, "BACK", 1);
}

/* PID Tuning page */
void ILI9341_ShowPIDTuningPage(void)
{
    pressure_control_page = 9;
    
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    ILI9341_DrawString(85, 15, "PID TUNING", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    
    // KRД°TД°K DГњZЖЏLД°Ећ: Manual ADC oxunmasД± silindi - yalnД±z PID sistemindЙ™n tЙ™zyiq gГ¶tГјrГјlГјr
    // PID sistemi hЙ™r 10ms-dЙ™ bir ADC oxuyur vЙ™ g_system_status.current_pressure-Д± yenilЙ™yir
    // Bu, ADC kanallarД±nД±n ziddiyyЙ™tini vЙ™ loop qeyri-dЙ™qiqliyini aradan qaldД±rД±r
    SystemStatus_t* status = AdvancedPressureControl_GetStatus();
    float current_pressure_val = status->current_pressure;
    
    // Update status with latest pressure reading
    status->current_pressure = current_pressure_val;
    
    char info[40];
    sprintf(info, "P: %.1f BAR", current_pressure_val);
    ILI9341_DrawString(20, 45, info, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
    sprintf(info, "SP: %.1f BAR", status->target_pressure);
    ILI9341_DrawString(150, 45, info, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    // SP +/- controls - DГњZЖЏLД°Ећ: 10-10 dЙ™yiЕџir, dГјymЙ™lЙ™r daha bГ¶yГјk vЙ™ "-10"/"+10" gГ¶stЙ™rir
    ILI9341_DrawControlButton(260, 40, 30, 30, ILI9341_COLOR_WHITE, "-10", 1);  // DГњZЖЏLД°Ећ: "-10" gГ¶stЙ™rir vЙ™ daha bГ¶yГјk
    ILI9341_DrawControlButton(295, 40, 30, 30, ILI9341_COLOR_WHITE, "+10", 1);  // DГњZЖЏLД°Ећ: "+10" gГ¶stЙ™rir vЙ™ daha bГ¶yГјk
    
    // Read current PID from AdvancedPressureControl system
    float kp = g_pid_zme.Kp;
    float ki = g_pid_zme.Ki;
    float kd = g_pid_zme.Kd;
    
    // Kp row
    ILI9341_DrawString(20, 80, "Kp:", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    char val[24];
    // DГњZЖЏLД°Ећ: Standart format - Kp ГјГ§Гјn 2 onluq yer (0.00 formatД±)
    sprintf(val, "%.2f", kp);
    ILI9341_DrawString(80, 80, val, ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 2);
    ILI9341_DrawControlButton(190, 75, 45, 30, ILI9341_COLOR_WHITE, "-", 2);
    ILI9341_DrawControlButton(245, 75, 45, 30, ILI9341_COLOR_WHITE, "+", 2);
    
    // Ki row
    ILI9341_DrawString(20, 120, "Ki:", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    // DГњZЖЏLД°Ећ: Standart format - Ki ГјГ§Гјn 4 onluq yer (0.0000 formatД±)
    sprintf(val, "%.4f", ki);
    ILI9341_DrawString(80, 120, val, ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 2);
    ILI9341_DrawControlButton(190, 115, 45, 30, ILI9341_COLOR_WHITE, "-", 2);
    ILI9341_DrawControlButton(245, 115, 45, 30, ILI9341_COLOR_WHITE, "+", 2);
    
    // Kd row
    ILI9341_DrawString(20, 160, "Kd:", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    // DГњZЖЏLД°Ећ: Standart format - Kd ГјГ§Гјn 3 onluq yer (0.000 formatД±)
    sprintf(val, "%.3f", kd);
    ILI9341_DrawString(80, 160, val, ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 2);
    ILI9341_DrawControlButton(190, 155, 45, 30, ILI9341_COLOR_WHITE, "-", 2);
    ILI9341_DrawControlButton(245, 155, 45, 30, ILI9341_COLOR_WHITE, "+", 2);
    
