valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
                    /* CAL MIN button - larger button */
                    if (screen_x >= 20 && screen_x <= 110 && screen_y >= 190 && screen_y <= 230) {
                        /* KRД°TД°K DГњZЖЏLД°Ећ: ADC oxunmasД± PID sistemindЙ™n gГ¶tГјrГјlГјr - ADC bloklanmasД± yoxdur */
                        /* PID sistemi hЙ™r 10ms-dЙ™ bir ADC oxuyur vЙ™ Status strukturuna yazД±r */
                        SystemStatus_t* cal_status = AdvancedPressureControl_GetStatus();
                        uint16_t adc_value = cal_status->raw_adc_value;  // Xam ADC dЙ™yЙ™ri Status-dan
                        adc_min = adc_value;  /* Set as minimum ADC value */
                        min_pressure = 0.0f; /* DГњZЖЏLД°Ећ: Set pressure to 0.0 bar (sД±fД±r tЙ™zyiq) */
                        calibration_mode = 0; /* Reset calibration mode */
                        
                        /* Show confirmation */
                        ILI9341_DrawString(20, 200, "MIN CALIBRATED!", ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 1);
                        
                        /* DГњZЖЏLД°Ећ: KalibrlЙ™mЙ™ dЙ™yЙ™rlЙ™rini dЙ™rhal Advanced sistemЙ™ Г¶tГјr */
                        extern CalibrationData_t g_calibration;
                        g_calibration.adc_min = (float)adc_min;
                        g_calibration.pressure_min = min_pressure;  // 0.0 bar
                            
                            // Recalculate slope and offset immediately if both min and max are set
                            if (adc_max > adc_min) {
                                g_calibration.slope = (max_pressure - min_pressure) / (float)(adc_max - adc_min);
                                g_calibration.offset = min_pressure - (g_calibration.slope * (float)adc_min);
                                printf("MIN Calibration updated - ADC: %d, Pressure: %.2f bar, Slope: %.6f, Offset: %.2f\r\n",
                                       adc_min, min_pressure, g_calibration.slope, g_calibration.offset);
                            }
                        PressureControlConfig_UpdateCalibrationCache(&g_calibration);
                        /* KRД°TД°K DГњZЖЏLД°Ећ: HAL_ADC_Stop() silindi - artД±q manual ADC oxunmasД± yoxdur */
                        ILI9341_ShowPressureCalibrationPage(); /* Refresh page */
                    }
                    /* CAL MAX button - larger button */
                    else if (screen_x >= 120 && screen_x <= 210 && screen_y >= 190 && screen_y <= 230) {
                        /* KRД°TД°K DГњZЖЏLД°Ећ: ADC oxunmasД± PID sistemindЙ™n gГ¶tГјrГјlГјr - ADC bloklanmasД± yoxdur */
                        /* PID sistemi hЙ™r 10ms-dЙ™ bir ADC oxuyur vЙ™ Status strukturuna yazД±r */
                        SystemStatus_t* cal_status = AdvancedPressureControl_GetStatus();
                        uint16_t adc_value = cal_status->raw_adc_value;  // Xam ADC dЙ™yЙ™ri Status-dan
                        adc_max = adc_value;  /* Set as maximum ADC value */
                        max_pressure = 300.0f; /* Set pressure to 300.0 bar (full range) - DГњZЖЏLД°Ећ: float literal */
                        calibration_mode = 0; /* Reset calibration mode */
                        
                        /* Show confirmation */
                        ILI9341_DrawString(110, 200, "MAX CALIBRATED!", ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 1);
                        
                        /* DГњZЖЏLД°Ећ: KalibrlЙ™mЙ™ dЙ™yЙ™rlЙ™rini dЙ™rhal Advanced sistemЙ™ Г¶tГјr */
                        extern CalibrationData_t g_calibration;
                            g_calibration.adc_max = (float)adc_max;
                            g_calibration.pressure_max = max_pressure;
                            
                            // Recalculate slope and offset immediately
                            if (adc_max > adc_min) {
                                g_calibration.slope = (max_pressure - min_pressure) / (float)(adc_max - adc_min);
                                g_calibration.offset = min_pressure - (g_calibration.slope * (float)adc_min);
                                printf("MAX Calibration updated - ADC: %d, Pressure: %.2f bar, Slope: %.6f, Offset: %.2f\r\n",
                                       adc_max, max_pressure, g_calibration.slope, g_calibration.offset);
                            }
                        PressureControlConfig_UpdateCalibrationCache(&g_calibration);
                        /* KRД°TД°K DГњZЖЏLД°Ећ: HAL_ADC_Stop() silindi - artД±q manual ADC oxunmasД± yoxdur */
                        /* ADC dЙ™yЙ™ri Status-dan gГ¶tГјrГјlГјr, ona gГ¶rЙ™ dЙ™ Stop() lazД±m deyil */
                        ILI9341_ShowPressureCalibrationPage(); /* Refresh page */
                    }
                    /* SAVE button - larger button */
                    else if (screen_x >= 220 && screen_x <= 310 && screen_y >= 190 && screen_y <= 230) {
                        /* DГњZЖЏLД°Ећ: Advanced sistem kalibrlЙ™mЙ™ funksiyasД±nД± istifadЙ™ et */
                        // UI-dan kalibrlЙ™mЙ™ dЙ™yЙ™rlЙ™rini Advanced sistemЙ™ Г¶tГјr
                        extern uint16_t adc_min, adc_max;
                        extern float min_pressure, max_pressure;
                        
                        // Validate calibration values
                        if (adc_max <= adc_min) {
                            ILI9341_DrawString(200, 200, "ERROR: Invalid ADC range!", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 1);
                            HAL_Delay(2000);
                            ILI9341_ShowPressureCalibrationPage();
                            // DГњZЖЏLД°Ећ: break yerinЙ™ return - if-else blokunun iГ§indЙ™ break istifadЙ™ oluna bilmЙ™z
                            return;
                        }
                        
                        // Update Advanced system calibration structure from UI values
                        extern CalibrationData_t g_calibration;
                        g_calibration.adc_min = (float)adc_min;
                        g_calibration.adc_max = (float)adc_max;
                        g_calibration.pressure_min = min_pressure;  // DГњZЖЏLД°Ећ: 0.0 bar olmalД±dД±r
                        g_calibration.pressure_max = max_pressure;
                        
                        // Calculate slope and offset
                        g_calibration.slope = (max_pressure - min_pressure) / (float)(adc_max - adc_min);
                        g_calibration.offset = min_pressure - (g_calibration.slope * (float)adc_min);  // DГњZЖЏLД°Ећ: min_pressure = 0.0f
                        g_calibration.calibrated = true;
                        PressureControlConfig_UpdateCalibrationCache(&g_calibration);
                        
