valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
                        // Show confirmation message
                        ILI9341_DrawString(250, 100, "SAVED!", ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 2);
                        HAL_Delay(500);
                        ILI9341_ShowPIDTuningPage();
                    }
                    break;
            }
        }
        HAL_Delay(200); /* Debounce */
    }
}

/* Simple touch test function */
void ILI9341_SimpleTouchTest(void)
{
    static uint32_t last_touch_time = 0;
    uint32_t current_time = HAL_GetTick();
    
    /* Only check touch every 100ms to avoid too frequent updates */
    if (current_time - last_touch_time >= 100) {
        last_touch_time = current_time;
        
        uint16_t raw_x, raw_y, screen_x, screen_y;
        
        if (XPT2046_IsTouched()) {
            if (XPT2046_GetCoordinates(&raw_x, &raw_y)) {
                XPT2046_ConvertToScreen(raw_x, raw_y, &screen_x, &screen_y);
                
                /* Clean touch handling - no debug clutter */
            }
        }
    }
}

/* Pressure control logic - maintains pressure at set limit */
void ILI9341_PressureControlLogic(void)
{
    static uint32_t last_control_time = 0;
    static uint32_t last_pid_update_time = 0;
    uint32_t current_time = HAL_GetTick();
    
    // KRД°TД°K DГњZЖЏLД°Ећ: Target SP dЙ™yiЕџЙ™n kimi Flash-a yazma mЙ™ntiqini silin
    // ArtД±q AdvancedPressureControl Г¶zГј target_pressure-i yaddaЕџdan oxuyur
    // vЙ™ yalnД±z Save dГјymЙ™si basД±ldД±qda yazmalД±dД±r (PID Tuning sЙ™hifЙ™sindЙ™)
    
    /* Run control logic every 100ms (Update only) */
    if (current_time - last_control_time >= 100) {
        last_control_time = current_time;
        
        /* Get status from AdvancedPressureControl system */
        SystemStatus_t* status = AdvancedPressureControl_GetStatus();
        
        /* Read ZME and DRV PWM percentages from AdvancedPressureControl */
        zme_percent = status->zme_pwm_percent;
        drv_percent = status->drv_pwm_percent;
        motor_percent = status->motor_pwm_percent;
        
        /* Motor sГјrЙ™ti SP-yЙ™ gГ¶rЙ™ tЙ™nzimlЙ™nir - bu mЙ™ntiq AdvancedPressureControl_Step()-dЙ™dir.
         * Bizim burada yalnД±z statusu yenilЙ™mЙ™yimiz lazД±mdД±r. */
        if (motor_percent < 0.0f) motor_percent = 0.0f;
        if (motor_percent > 100.0f) motor_percent = 100.0f;
        
        /* Update displays if on main page */
        if (pressure_control_page == 0) {
            // Update pressure display here as well for immediate feedback
            ILI9341_UpdatePressureDisplay(status->current_pressure);
            ILI9341_UpdatePercentageDisplays(drv_percent, zme_percent, motor_percent);
        }
    }
    
    /* Update PID tuning page pressure display every 200ms */
    if (current_time - last_pid_update_time >= 200) {
        last_pid_update_time = current_time;
        
        if (pressure_control_page == 9) { // PID Tuning page
            /* DГњZЖЏLД°Ећ: AdvancedPressureControl sistemindЙ™n tЙ™zyiq oxu (kalibrlЙ™mЙ™ sinxronizasiyasД± ГјГ§Гјn) */
            /* DEPRECATED: PressureSensor_ConvertToPressure artД±q istifadЙ™ olunmur */
            
            // KRД°TД°K DГњZЖЏLД°Ећ: Manual ADC oxunmasД± silindi - yalnД±z PID sistemindЙ™n tЙ™zyiq gГ¶tГјrГјlГјr
            // PID sistemi hЙ™r 10ms-dЙ™ bir ADC oxuyur vЙ™ g_system_status.current_pressure-Д± yenilЙ™yir
            SystemStatus_t* status = AdvancedPressureControl_GetStatus();
            float current_pressure_val = status->current_pressure;
            
            /* Update pressure display on PID tuning page */
            char info[40];
            sprintf(info, "P: %.1f BAR", current_pressure_val);
            /* Clear old text and draw new */
            ILI9341_DrawRectangle(20, 45, 100, 15, ILI9341_COLOR_BLACK);
            ILI9341_DrawString(20, 45, info, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
        }
    }
}

/* ==================== PWM CONTROL FUNCTIONS ==================== */

/* External TIM3 handle */
extern TIM_HandleTypeDef htim3;

/* PWM to Voltage Converter Module Configuration:
 * Module: PWM to Voltage Converter 0%~100% to 0~10V
 * 
 * Connection:
 * - PWM Input: Connect to PC6 (TIM3_CH1) for Motor PWM
 * - GND: Connect to system ground
 * - VCC: Connect to 5V or 3.3V (check module requirements)
 * - Output: 0-10V analog signal for motor control
 * 
 * PWM Settings for optimal performance:
 * - Frequency: 1-10 kHz (recommended: 1 kHz)
 * - Duty Cycle: 0-100% (0% = 0V, 100% = 10V)
 * - Voltage Level: 3.3V or 5V (select via jumper on module)
 */

/* PWM Control Functions */
void PWM_SetMotorDutyCycle(float duty_percent)
{
    if (duty_percent < 0.0) duty_percent = 0.0;
    if (duty_percent > 100.0) duty_percent = 100.0;
    
    /* Get current timer period */
    uint32_t period = __HAL_TIM_GET_AUTORELOAD(&htim3);
    
    /* Convert percentage to compare value based on current period */
    uint32_t compare_value = (uint32_t)((duty_percent / 100.0) * period);
    __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, compare_value);
    
    /* Update global variable */
    motor_duty_cycle = duty_percent;
}

void PWM_SetDRVDutyCycle(float duty_percent)
{
    if (duty_percent < 0.0) duty_percent = 0.0;
    if (duty_percent > 100.0) duty_percent = 100.0;
    
    /* Get current timer period */
    uint32_t period = __HAL_TIM_GET_AUTORELOAD(&htim3);
    
    /* Convert percentage to compare value based on current period */
    uint32_t compare_value = (uint32_t)((duty_percent / 100.0) * period);
    __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, compare_value);
    
    /* Update global variable */
    drv_percent = duty_percent;
}

void PWM_SetZMEDutyCycle(float duty_percent)
{
    if (duty_percent < 0.0) duty_percent = 0.0;
    if (duty_percent > 100.0) duty_percent = 100.0;
    
    /* Get current timer period */
    uint32_t period = __HAL_TIM_GET_AUTORELOAD(&htim3);
    
    /* Convert percentage to compare value based on current period */
    uint32_t compare_value = (uint32_t)((duty_percent / 100.0) * period);
    __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_3, compare_value);
    
    /* Update global variable */
    zme_percent = duty_percent;
}

void PWM_SetMotorFrequency(float frequency_hz)
{
    if (frequency_hz < 100.0f) frequency_hz = 100.0f;
    if (frequency_hz > 10000.0f) frequency_hz = 10000.0f;
    
    /* TIM3 runs from a 1 MHz base clock (Prescaler = 83). Keep ARR within 16-bit. */
    const uint32_t timer_clock_hz = 1000000U;
    uint32_t desired_period = (uint32_t)(timer_clock_hz / frequency_hz);
    if (desired_period == 0U) {
        desired_period = 1U;
    }
    uint32_t arr = desired_period - 1U;
    if (arr > 0xFFFFU) {
        arr = 0xFFFFU;
    }
    
