valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
    __HAL_TIM_SET_AUTORELOAD(&htim3, arr);
    
    motor_frequency = frequency_hz;
    
    /* Recalculate duty cycle with new period so PWM keeps the same percentage */
    PWM_SetMotorDutyCycle(motor_duty_cycle);
}

void PWM_UpdateAllChannels(void)
{
    /* Update all PWM channels with current values */
    PWM_SetMotorDutyCycle(motor_duty_cycle);
    PWM_SetDRVDutyCycle(drv_percent);
    PWM_SetZMEDutyCycle(zme_percent);
    PWM_SetMotorFrequency(motor_frequency);
}

void PWM_TestSequence(void)
{
    /* Test sequence for PWM to voltage converter module */
    
    /* Test 1: 0% duty cycle */
    PWM_SetMotorDutyCycle(0.0);
    HAL_Delay(2000);
    
    /* Test 2: 25% duty cycle */
    PWM_SetMotorDutyCycle(25.0);
    HAL_Delay(2000);
    
    /* Test 3: 50% duty cycle */
    PWM_SetMotorDutyCycle(50.0);
    HAL_Delay(2000);
    
    /* Test 4: 75% duty cycle */
    PWM_SetMotorDutyCycle(75.0);
    HAL_Delay(2000);
    
    /* Test 5: 100% duty cycle */
    PWM_SetMotorDutyCycle(100.0);
    HAL_Delay(2000);
    
    /* Return to 0% */
    PWM_SetMotorDutyCycle(0.0);
}

/* ==================== PRESSURE SENSOR CALIBRATION FUNCTIONS ==================== */

/* External ADC handle */
extern ADC_HandleTypeDef hadc3;

/* Function to check ADC pin configuration */
void PressureSensor_CheckPinConfiguration(void)
{
    /* Check if ADC3 is properly configured */
    if (hadc3.Instance != ADC3) {
        if (pressure_control_page == 0) {
            ILI9341_DrawString(10, 10, "ADC3 NOT CONFIGURED", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 1);
        }
        return;
    }
    
    /* Check ADC channel configuration */
    if (hadc3.Init.Resolution != ADC_RESOLUTION_12B) {
        if (pressure_control_page == 0) {
            ILI9341_DrawString(10, 10, "ADC RESOLUTION ERROR", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 1);
        }
        return;
    }
    
    /* Check if ADC is ready */
    if (HAL_ADC_GetState(&hadc3) != HAL_ADC_STATE_READY) {
        if (pressure_control_page == 0) {
            ILI9341_DrawString(10, 10, "ADC NOT READY", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 1);
        }
        return;
    }
    
    /* ADC configuration is OK - no need to show on main page */
}

void PressureSensor_Calibrate(void)
{
    /* KRД°TД°K DГњZЖЏLД°Ећ: ADC oxunmasД± PID sistemindЙ™n gГ¶tГјrГјlГјr - ADC bloklanmasД± yoxdur */
    SystemStatus_t* status = AdvancedPressureControl_GetStatus();
    uint16_t adc_value = status->raw_adc_value;  // Xam ADC dЙ™yЙ™ri Status-dan
    
    if (calibration_mode == 1) {
        /* Calibrate minimum */
        adc_min = adc_value;
        calibration_mode = 0;
    }
    else if (calibration_mode == 2) {
        /* Calibrate maximum */
        adc_max = adc_value;
        calibration_mode = 0;
    }
}

/* 
 * QEYD: KalibrlЙ™mЙ™ mЙ™ntiqi yalnД±z Advanced sistem daxilindЙ™ (advanced_pressure_control.c)
 * saxlanД±lД±r. UI funksiyalarД± Advanced sistemin funksiyalarД±nД± Г§aДџД±rД±r:
 * - AdvancedPressureControl_LoadCalibration() - Flash-dan kalibrlЙ™mЙ™ yГјklЙ™mЙ™
 * - AdvancedPressureControl_SaveCalibration() - Flash-a kalibrlЙ™mЙ™ yazma
 * - AdvancedPressureControl_ReadPressure() - TЙ™zyiq oxuma (kalibrlЙ™mЙ™ ilЙ™)
 */

/* Convert pressure to motor percentage (0-100%) */
float PressureToMotorPercent(float pressure)
{
    if (pressure < min_pressure) pressure = min_pressure;
    if (pressure > max_pressure) pressure = max_pressure;
    
    /* Formula: Motor% = (P - 0.2) * 0.3181 */
    float motor_percent = (pressure - min_pressure) * MOTOR_PERCENT_PER_BAR;
    
    /* Clamp to 0-100% */
    if (motor_percent < 0.0f) motor_percent = 0.0f;
    if (motor_percent > 100.0f) motor_percent = 100.0f;
    
    return motor_percent;
}

/* Convert motor percentage to pressure */
float MotorPercentToPressure(float motor_percent)
{
    if (motor_percent < 0.0f) motor_percent = 0.0f;
    if (motor_percent > 100.0f) motor_percent = 100.0f;
    
    /* Formula: P = 0.2 + (Motor%) * 3.144 */
    float pressure = min_pressure + motor_percent * MOTOR_BAR_PER_PERCENT;
    
    return pressure;
}

/* Convert pressure to DRV percentage (10-40% range) */
float PressureToDRVPercent(float pressure)
{
    if (pressure < min_pressure) pressure = min_pressure;
    if (pressure > max_pressure) pressure = max_pressure;
    
    /* Formula: DRV% = 10 + (P - 0.2) * 0.09545 */
    float drv_percent = 10.0f + (pressure - min_pressure) * DRV_PERCENT_PER_BAR;
    
    /* Clamp to 10-40% */
    if (drv_percent < 10.0f) drv_percent = 10.0f;
    if (drv_percent > 40.0f) drv_percent = 40.0f;
    
    return drv_percent;
}

/* Convert pressure to ZME percentage (0-30% range, inverse) */
float PressureToZMEPercent(float pressure)
{
    if (pressure < zme_min_pressure) pressure = zme_min_pressure;
    if (pressure > zme_max_pressure) pressure = zme_max_pressure;
    
    /* ZME for pressure control: inverse relationship */
    /* At low pressure: ZME = 0% (open) - allow pressure to rise */
    /* At high pressure: ZME = 30% (closed) - prevent pressure overshoot */
    float pressure_range = zme_max_pressure - zme_min_pressure;
    float zme_percent = ((zme_max_pressure - pressure) / pressure_range) * 30.0f;
    
    /* ZME pressure control logic - improved */
    if (pressure < 10.0f) {
        zme_percent = 0.0f;  /* Very low pressure: ZME fully open for pressure rise */
    } else if (pressure > 150.0f) {
        zme_percent = 30.0f;  /* High pressure: ZME closed to prevent overshoot */
    }
    
    /* Clamp to 0-30% */
    if (zme_percent < 0.0f) zme_percent = 0.0f;
    if (zme_percent > 30.0f) zme_percent = 30.0f;
    
    return zme_percent;
}

/* IMPROVED debug function to check sensor status */
void PressureSensor_DebugStatus(void)
{
    /* KRД°TД°K DГњZЖЏLД°Ећ: ADC oxunmasД± PID sistemindЙ™n gГ¶tГјrГјlГјr - ADC bloklanmasД± yoxdur */
    SystemStatus_t* status = AdvancedPressureControl_GetStatus();
    uint16_t raw_adc = status->raw_adc_value;  // Xam ADC dЙ™yЙ™ri Status-dan
    
    /* Calculate voltage: V = (ADC / 4095) * 3.3V */
    float voltage = (float)raw_adc * 3.3f / 4095.0f;
    
    /* PID sistemindЙ™n tЙ™zyiq dЙ™yЙ™rini gГ¶tГјr */
    float pressure = status->current_pressure;
    
    /* Check for sensor problems - only show critical errors */
    if (raw_adc < 50) {
        /* Very low ADC - possible sensor disconnection */
        if (pressure_control_page == 0) {
            ILI9341_DrawString(10, 10, "SENSOR ERROR: Low ADC", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 1);
        }
    } else if (raw_adc > 4000) {
        /* Very high ADC - possible sensor short circuit */
        if (pressure_control_page == 0) {
            ILI9341_DrawString(10, 10, "SENSOR ERROR: High ADC", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 1);
        }
    }
    /* Normal reading - no debug clutter on main page */
    /* KRД°TД°K DГњZЖЏLД°Ећ: HAL_ADC_Stop() silindi - artД±q manual ADC oxunmasД± yoxdur */
    /* ADC dЙ™yЙ™ri Status-dan gГ¶tГјrГјlГјr, ona gГ¶rЙ™ dЙ™ Stop() lazД±m deyil */
}

