valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
void ILI9341_HandleCalibrationTouch(void)
{
    /* Handle calibration touch events */
    if (pressure_control_page == 8) {
        /* Update ADC reading display */
        static uint32_t last_adc_update = 0;
        uint32_t current_time = HAL_GetTick();
        
        if (current_time - last_adc_update > 200) { /* Update every 200ms for better responsiveness */
            last_adc_update = current_time;
            
            /* KRД°TД°K DГњZЖЏLД°Ећ: ADC oxunmasД± PID sistemindЙ™n gГ¶tГјrГјlГјr - ADC bloklanmasД± yoxdur */
            SystemStatus_t* status = AdvancedPressureControl_GetStatus();
            uint16_t adc_value = status->raw_adc_value;  // Xam ADC dЙ™yЙ™ri Status-dan
            
            /* Update display with current ADC value */
            char adc_str[30];
            sprintf(adc_str, "ADC: %d", adc_value);
            ILI9341_DrawString(20, 170, adc_str, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
            
            /* PID sistemindЙ™n tЙ™zyiq dЙ™yЙ™rini gГ¶tГјr */
            float current_pressure = status->current_pressure;
            char pressure_str[30];
            sprintf(pressure_str, "Pressure: %.1f bar", current_pressure);
            ILI9341_DrawString(20, 180, pressure_str, ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 1);
            
            /* Show calibration values */
            char debug_cal_str[50];
            sprintf(debug_cal_str, "Cal: %d-%d -> %.1f-%.1f", adc_min, adc_max, min_pressure, max_pressure);
            ILI9341_DrawString(20, 190, debug_cal_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
            /* KRД°TД°K DГњZЖЏLД°Ећ: HAL_ADC_Stop() silindi - artД±q manual ADC oxunmasД± yoxdur */
            /* ADC dЙ™yЙ™ri Status-dan gГ¶tГјrГјlГјr, ona gГ¶rЙ™ dЙ™ Stop() lazД±m deyil */
        }
    }
}

